# HasResolutionOfType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessageAccessor..::..HasResolutionOfType Method
FailureMessageAccessor Class See Also
---
Checks if failure has a resolution of a given type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasResolutionOfType(
	FailureResolutionType type
)
```

Visual Basic
---
```text
Public Function HasResolutionOfType ( _
	type As FailureResolutionType _
) As Boolean
```

Visual C++
---
```text
public:
bool HasResolutionOfType(
	FailureResolutionType type
)
```

# ### Parameters
type
    Type: Autodesk.Revit.DB..::..FailureResolutionType The type of resolution.
# ### Return Value
True if failure has a resolution of a given type, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

# See Also
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace